; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v6 ?v13)
             (pred_8 ?v1 ?v10)
             (pred_5 ?v6 ?v10)
             (pred_4 ?v2 ?v6 )
	     (pred_6 ?v6)
             (pred_3 ?v8)
             (pred_1 ?v1)
             (pred_11 ?v10)
             (pred_12 ?v6)
             (pred_7 ?v1)
             (pred_2 ?v6)
             (pred_9 ))



(:action op_5
:parameters (?v7 ?v12 ?v4 ?v3)
:precondition (and (pred_3 ?v7) (pred_3 ?v12) (pred_1 ?v4) (pred_11 ?v3)
          (pred_10 ?v7 ?v12) (pred_8 ?v4 ?v3)
                   (pred_5 ?v12 ?v3) (pred_6 ?v7) 
                   (pred_12 ?v12) (pred_7 ?v4))
:effect (and  (pred_2 ?v12) (not (pred_12 ?v12))))


(:action op_3
:parameters (?v7 ?v11)
:precondition (and (pred_3 ?v7) (pred_3 ?v11)
               (pred_6 ?v7) (pred_10 ?v7 ?v11) (pred_2 ?v11))
:effect (and (pred_6 ?v11) (not (pred_6 ?v7))))

(:action op_1
:parameters (?v7 ?v4)
:precondition (and (pred_3 ?v7) (pred_1 ?v4) 
                  (pred_6 ?v7) (pred_4 ?v4 ?v7) (pred_9 ))
:effect (and (pred_7 ?v4)
   (not (pred_4 ?v4 ?v7)) (not (pred_9 ))))


(:action op_2
:parameters (?v7 ?v5 ?v9)
:precondition (and (pred_3 ?v7) (pred_1 ?v5) (pred_1 ?v9)
                  (pred_6 ?v7) (pred_7 ?v9) (pred_4 ?v5 ?v7))
:effect (and (pred_7 ?v5) (pred_4 ?v9 ?v7)
        (not (pred_7 ?v9)) (not (pred_4 ?v5 ?v7))))

(:action op_4
:parameters (?v7 ?v4)
:precondition (and (pred_3 ?v7) (pred_1 ?v4) 
                  (pred_6 ?v7) (pred_7 ?v4))
:effect (and (pred_9 ) (pred_4 ?v4 ?v7) (not (pred_7 ?v4)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_06 obj_04 obj_11 obj_15 obj_17 obj_01 obj_13 obj_18 obj_19 obj_08 obj_07 obj_14 obj_10 obj_05 obj_02 obj_12
    obj_16 obj_03
    obj_09 obj_20
    )

    (:init
       (pred_9)

       (pred_3 obj_06)
       (pred_3 obj_04)
       (pred_3 obj_11)
       (pred_3 obj_15)
       (pred_3 obj_17)
       (pred_3 obj_01)
       (pred_3 obj_13)
       (pred_3 obj_18)
       (pred_3 obj_19)
       (pred_3 obj_08)
       (pred_3 obj_07)
       (pred_3 obj_14)
       (pred_3 obj_10)
       (pred_3 obj_05)
       (pred_3 obj_02)
       (pred_3 obj_12)
       (pred_11 obj_16)
       (pred_11 obj_03)
       (pred_1 obj_09)
       (pred_1 obj_20)

       (pred_10 obj_06 obj_17)
       (pred_10 obj_06 obj_04)
       (pred_10 obj_04 obj_01)
       (pred_10 obj_04 obj_11)
       (pred_10 obj_04 obj_06)
       (pred_10 obj_11 obj_13)
       (pred_10 obj_11 obj_15)
       (pred_10 obj_11 obj_04)
       (pred_10 obj_15 obj_18)
       (pred_10 obj_15 obj_11)
       (pred_10 obj_17 obj_19)
       (pred_10 obj_17 obj_01)
       (pred_10 obj_17 obj_06)
       (pred_10 obj_01 obj_08)
       (pred_10 obj_01 obj_13)
       (pred_10 obj_01 obj_04)
       (pred_10 obj_01 obj_17)
       (pred_10 obj_13 obj_07)
       (pred_10 obj_13 obj_18)
       (pred_10 obj_13 obj_11)
       (pred_10 obj_13 obj_01)
       (pred_10 obj_18 obj_14)
       (pred_10 obj_18 obj_15)
       (pred_10 obj_18 obj_13)
       (pred_10 obj_19 obj_10)
       (pred_10 obj_19 obj_08)
       (pred_10 obj_19 obj_17)
       (pred_10 obj_08 obj_05)
       (pred_10 obj_08 obj_07)
       (pred_10 obj_08 obj_01)
       (pred_10 obj_08 obj_19)
       (pred_10 obj_07 obj_02)
       (pred_10 obj_07 obj_14)
       (pred_10 obj_07 obj_13)
       (pred_10 obj_07 obj_08)
       (pred_10 obj_14 obj_12)
       (pred_10 obj_14 obj_18)
       (pred_10 obj_14 obj_07)
       (pred_10 obj_10 obj_05)
       (pred_10 obj_10 obj_19)
       (pred_10 obj_05 obj_02)
       (pred_10 obj_05 obj_08)
       (pred_10 obj_05 obj_10)
       (pred_10 obj_02 obj_12)
       (pred_10 obj_02 obj_07)
       (pred_10 obj_02 obj_05)
       (pred_10 obj_12 obj_14)
       (pred_10 obj_12 obj_02)
       (pred_12 obj_07)
       (pred_12 obj_15)
       (pred_5  obj_07 obj_16)
       (pred_5  obj_15 obj_03)
       (pred_2 obj_06)
       (pred_2 obj_04)
       (pred_2 obj_11)
       (pred_2 obj_17)
       (pred_2 obj_01)
       (pred_2 obj_13)
       (pred_2 obj_18)
       (pred_2 obj_19)
       (pred_2 obj_08)
       (pred_2 obj_14)
       (pred_2 obj_10)
       (pred_2 obj_05)
       (pred_2 obj_02)
       (pred_2 obj_12)

       (pred_8  obj_09 obj_16)
       (pred_8  obj_20 obj_03)
       (pred_4 obj_09 obj_02)
       (pred_4 obj_20 obj_05)
       (pred_6 obj_05)
    )

    (:goal (and
       (pred_4 obj_20 obj_18)
    ))
(:constraints
  (always (not (pred_6 obj_08)))
)
)

; plan
1. (op_1 obj_05 obj_20)
   deleted: (pred_4 obj_20 obj_05) (pred_9)
   added: (pred_7 obj_20)
   goals met: 0 of 1
2. (op_3 obj_05 obj_02)
   deleted: (pred_6 obj_05)
   added: (pred_6 obj_02)
   goals met: 0 of 1
3. (op_3 obj_02 obj_12)
   deleted: (pred_6 obj_02)
   added: (pred_6 obj_12)
   goals met: 0 of 1
4. (op_3 obj_12 obj_14)
   deleted: (pred_6 obj_12)
   added: (pred_6 obj_14)
   goals met: 0 of 1
5. (op_3 obj_14 obj_18)
   deleted: (pred_6 obj_14)
   added: (pred_6 obj_18)
   goals met: 0 of 1
6. (op_4 obj_18 obj_20)
   deleted: (pred_7 obj_20)
   added: (pred_9) (pred_4 obj_20 obj_18)
   goals met: 1 of 1
